; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	thermograph5 - mode
	image3 - mode
	spectrograph0 - mode
	infrared2 - mode
	thermograph4 - mode
	thermograph1 - mode
	image7 - mode
	image6 - mode
	Star1 - direction
	Star3 - direction
	GroundStation0 - direction
	GroundStation4 - direction
	Star5 - direction
	Star2 - direction
	Star6 - direction
	Planet7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 image7)
	(supports instrument1 thermograph5)
	(supports instrument1 thermograph1)
	(supports instrument1 thermograph4)
	(supports instrument1 image3)
	(calibration_target instrument1 Star2)
	(supports instrument2 image7)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon9)
	(supports instrument3 image7)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 Star2)
	(supports instrument4 image6)
	(supports instrument4 image7)
	(supports instrument4 infrared2)
	(calibration_target instrument4 Star2)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star10)
)
(:goal (and
	(pointing satellite0 Star6)
	(have_image Star6 image3)
	(have_image Star6 infrared2)
	(have_image Planet7 thermograph4)
	(have_image Planet8 image3)
	(have_image Planet8 spectrograph0)
	(have_image Phenomenon9 infrared2)
	(have_image Star10 thermograph5)
	(have_image Star10 image7)
	(have_image Planet11 spectrograph0)
	(have_image Planet11 image3)
))

)

; plan
1. (turn_to satellite1 star2 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star2)
   goals met: 0 of 11
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 11
3. (calibrate satellite1 instrument3 star2)
   added: (calibrated instrument3)
   goals met: 0 of 11
4. (turn_to satellite1 planet8 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 planet8)
   goals met: 0 of 11
5. (take_image satellite1 planet8 instrument3 spectrograph0)
   added: (have_image planet8 spectrograph0)
   goals met: 1 of 11
6. (turn_to satellite1 planet11 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet11)
   goals met: 1 of 11
7. (take_image satellite1 planet11 instrument3 spectrograph0)
   added: (have_image planet11 spectrograph0)
   goals met: 2 of 11
8. (turn_to satellite1 star2 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 star2)
   goals met: 2 of 11
9. (turn_to satellite0 star2 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 star2)
   goals met: 2 of 11
10. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 11
11. (switch_off instrument3 satellite1)
   deleted: (power_on instrument3)
   added: (power_avail satellite1)
   goals met: 2 of 11
12. (calibrate satellite0 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 2 of 11
13. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 2 of 11
14. (calibrate satellite1 instrument4 star2)
   added: (calibrated instrument4)
   goals met: 2 of 11
15. (turn_to satellite0 planet11 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet11)
   goals met: 2 of 11
16. (take_image satellite0 planet11 instrument1 image3)
   added: (have_image planet11 image3)
   goals met: 3 of 11
17. (turn_to satellite0 planet7 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet7)
   goals met: 3 of 11
18. (take_image satellite0 planet7 instrument1 thermograph4)
   added: (have_image planet7 thermograph4)
   goals met: 4 of 11
19. (turn_to satellite0 planet8 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet8)
   goals met: 4 of 11
20. (take_image satellite0 planet8 instrument1 image3)
   added: (have_image planet8 image3)
   goals met: 5 of 11
21. (turn_to satellite0 star10 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star10)
   goals met: 5 of 11
22. (take_image satellite0 star10 instrument1 image7)
   added: (have_image star10 image7)
   goals met: 6 of 11
23. (take_image satellite0 star10 instrument1 thermograph5)
   added: (have_image star10 thermograph5)
   goals met: 7 of 11
24. (turn_to satellite0 star6 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star6)
   goals met: 8 of 11
25. (take_image satellite0 star6 instrument1 image3)
   added: (have_image star6 image3)
   goals met: 9 of 11
26. (turn_to satellite1 phenomenon9 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 phenomenon9)
   goals met: 9 of 11
27. (take_image satellite1 phenomenon9 instrument4 infrared2)
   added: (have_image phenomenon9 infrared2)
   goals met: 10 of 11
28. (turn_to satellite1 star6 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 star6)
   goals met: 10 of 11
29. (take_image satellite1 star6 instrument4 infrared2)
   added: (have_image star6 infrared2)
   goals met: 11 of 11
